package com.taba3.team5.ezcard.model;


//카드 정보를 gpt system role로 입력하는 부분.
public class CardInfo {
    public static final String MESSAGE =
            "[카드이름:KB국민 My WE:SH 카드/연회비:15,000원/혜택:음식점10%할인,편의점10%할인,이동통신요금10%,OTT30%할인,영화관30%할인/신용카드], " +
                    "[카드이름:삼성 iD 달달할인 카드/연회비:29,000원/혜택:아파트 관리비·이동통신·렌탈·보험·학습지·학교납입금 건별10%할인,연 최대 42만원 할인/신용카드], " +
                    "[카드이름:삼성카드 taptap O/연회비:10,000원/혜택:스타벅스50%할인,대중교통10%할인,이동통신10%할인,영화5,000원할인/신용카드], "+
                    "[카드이름:현대카드ZERO Edition2(할인형)/연회비:10,000원/혜택:모든가맹점0,7%할인,생활필수영역1.5%할인,할인한도없음/신용카드], "+
                    "[카드이름:신한카드 Deep Oil/연회비:10,000/혜택:정유사10%할인,차량서비스10%할인,편의점5%할인,택시5%할인/신용카드], "+
                    "[카드이름:올바른 FLEX 카드/카드사:NH농협카드/연회비:12,000원/혜택:스타벅스50%할인,스트리밍20%할인,배달앱10%할인/신용카드], "+
                    "[카드이름:NU 오하쳌(오늘하루체크)/카드사:우리카드/혜택:온라인·간편결제·카페·배달앱·대중교통·이동통신5%캐시백/체크카드], " +
                    "[카드이름:장애인 통합복지 2030/혜택:고속도로 통행료 할인,장애인증 기능,다양한 일반 할인 서비스/복지카드], "+
                    "[카드이름:문화누리카드/카드사:NH농협카드/혜택:혜택 대상자 1인당 연간 11만원 지원/복지카드], "+
                    "[카드이름:노리체크카드/카드사:KB국민카드/혜택:대중교통10%할인,이통통신요금할인,cgv환급할인,아웃백20%,스타벅스20%,놀이공원50%/체크카드], "+
                    "[카드이름:삼성 iD VITA 카드/카드사:삼성카드/연회비:20,000원/혜택:병원20%할인,보험10%할인,대형마트10%할인,렌탈10%할인], ";
}