package com.taba3.team5.ezcard.model;


//카드 정보를 gpt system role로 입력하는 부분.
public class CardInfo {
    public static final String MESSAGE =
            "카드이름 : 노리체크카드,카드사:KB국민카드,연회비 : 없음, 전월실적조건 : 20만원 이상 , 상세혜택 : 버스/지하철 10% 청구할인, 이동통신요금 2,500원 환급할인, CGV 35% 환급할인, 아웃백/VIPS/스타벅스 20% 환급할인, 에버랜드/롯데월드 50% 환급할인, 금융수수료 면제 서비스, GS25 5% 환급할인, 교보문고 5% 환급할인"+
            "카드이름 : KB국민 My WE:SH 카드, 카드사 : KB국민카드, 연회비 : 국내전용 15,000원/해외겸용 15,000원, 전월실적조건 : 40만원 이상, 상세혜택 : KB Pay/음식점/편의점/이동통신요금 10% 할인, OTT 30% 할인, 먹는데진심-배달/커피 5% 할인, 노는데진심-택시/커피 5%/영화관 30% 할인, 관리에진심-미용실/스포츠/온라인서점/올리브영 5% 할인";






}
