package com.taba3.team5.ezcard.model;


//카드 정보를 gpt system role로 입력하는 부분.
public class CardInfo {
    public static final String MESSAGE =
            "카드이름 : 노리체크카드,카드사:KB국민카드,연회비 : 없음, 전월실적조건 : 20만원 이상 , 상세혜택 : 버스/지하철 10% 청구할인, 이동통신요금 2,500원 환급할인, CGV 35% 환급할인, 아웃백/VIPS/스타벅스 20% 환급할인, 에버랜드/롯데월드 50% 환급할인, 금융수수료 면제 서비스, GS25 5% 환급할인, 교보문고 5% 환급할인"+
            "카드이름 : 올바른 FLEX 카드, 카드사 : NH농협카드, 연회비 : 국내전용 10,000원/해외전용 12,000원, 전월실적조건 : 30만원 이상, 상세혜택 : 커피 50% 할인/스트리밍 20% 할인/영화 30% 할인, 카드타입 : 신용"+
            "카드이름 : 신한카드 Deep Dream, 카드사 : 신한카드, 연회비 : 해외겸용 8,000원, 전월실적조건 : 없음, 상세혜택 : 모두드림 0.7% 적립/더해드림 2.1% 적립/챙겨드림 3.5% 적립, 카드타입 : 신용"+
            "카드이름 : DA@카드의정석, 카드사 : 우리카드, 연회비 : 국내전용 5,000원/해외전용 10,000원, 전월실적조건 : 없음, 상세혜택 : 모든가맹점 0.8% 할인, 생활업종 1.3% 할인, 국내공항라운지 연 2회 무료(전월실적 30만원), 카드타입 : 신용"+
            "카드이름 : LOCA 365 카드, 카드사 : 롯데카드, 연회비 : 국내전용 20,000원/해외겸용20,000원 , 전월실적조건 : 50만원 이상, 상세혜택 : 아파트관리비, 공과금 10% 할인/교통, 통신, 배달앱 10% 할인/스트리밍 1,500원 할인, 카드타입 : 신용"+
            "카드이름 : 국민행복 삼성카드 V2 , 카드사 : 삼성카드, 연회비 : 없음, 전월실적조건 : 없음 , 상세혜택 : 쇼핑 7% 할인/보육 7% 할인/생활요금 7% 할인, 카드타입 : 복지"+
            "카드이름 : 신한카드 국민행복, 카드사 : 신한카드, 연회비 : 없음, 전월실적조건 : 30만원 이상, 상세혜택 : 넷플릭스, 유튜브 50% 할인/배달앱 10% 할인/어린이집, 유치원 10% 할인, 카드타입 : 복지"+
            "카드이름 : 롯데 국민행복카드, 카드사 : 롯데카드, 연회비 : 없음, 전월실적조건 : 30만원 이상, 상세혜택 : 어린이집보육료 10% 할인/병원 5% 할인/학원 10% 할인, 카드타입 : 복지"+
            "카드이름 : 삼성 iD POCKET 카드, 카드사 : 삼성카드, 연회비 : 없음, 전월실적조건 : 없음, 상세혜택 : 대중교통 최대 2% 할인/편의점 8% 할인/커피전문점 최대 8% 할인, 카드타입 : 체크"+
            "카드이름 : 카드의 정석 SSO3 NEW-TRO CHECK, 카드사 : 우리카드, 연회비 : 없음, 전월실적조건 : 30만원 이상, 상세혜택 : 저녁시간 음식점, 배달앱 5% 캐시백/대형마트, 편의점 5% 캐시백/택시, 버스, 지하철 5% 캐시백, 카드타입 : 체크"+
            "카드이름 : KB국민 Our WE:SH 카드, 카드사 : KB국민카드, 연회비 : 국내전용 15,000원/해외겸용 15,000원, 전월실적조건 : 40만원 이상, 상세혜택 : 대형마트 5% 청구할인/영화관, 공연장, 전시장, 10% 청구할인/이동통신 자동납부 10% 청구할인, 카드타입 : 신용"+
            "카드이름 : 탄탄대로 온리유카드, 카드사 : KB국민카드, 연회비 : 국내전용 15,000원/해외겸용 15,000원, 전월실적조건 : 40만원 이상, 상세혜택 : 모든 주유소 110~150점/L 적립 / 자동차보험 1만원 할인 / 차량정비 5% 적립, 카드타입 : 신용"+
            "카드이름 : KB국민 My WE:SH 카드, 카드사 : KB국민카드, 연회비 : 국내전용 15,000원/해외겸용 15,000원, 전월실적조건 : 40만원 이상, 상세혜택 : KB Pay/음식점/편의점/이동통신요금 10% 할인, OTT 30% 할인, 먹는데진심-배달/커피 5% 할인, 노는데진심-택시/커피 5%/영화관 30% 할인, 관리에진심-미용실/스포츠/온라인서점/올리브영 5% 할인";

}
