package com.taba3.team5.ezcard;


//카드 정보를 gpt system role로 입력하는 부분.
public class CardInfo {
    public static final String MESSAGE = "카드이름 : 신한카드 Mr.Life, 카드사 : 신한카드, 연회비 : 해외겸용 15,000원, 전월실적조건 : 30만원 이상, 상세혜택 : 월납요금(공과금) 10% 할인서비스, 편의점/병원/약국업종/세탁소/온라인쇼핑/택시/식음료/3대마트 10% 할인, 4대 정유사 리터당 60원 할인, 인테이크몰 20% 할인" +
                                         "카드이름 : KB국민 My WE:SH 카드, 카드사 : KB국민카드, 연회비 : 국내전용 15,000원/해외겸용 15,000원, 전월실적조건 : 40만원 이상, 상세혜택 : KB Pay/음식점/편의점/이동통신요금 10% 할인, OTT 30% 할인, 먹는데진심-배달/커피 5% 할인, 노는데진심-택시/커피 5%/영화관 30% 할인, 관리에진심-미용실/스포츠/온라인서점/올리브영 5% 할인" +
                                         "카드이름 : 삼성카드&MILEAGE PLATINUM(스카이패스), 카드사 : 삼성카드, 연회비 : 국내전용 47,000원/해외겸용 49,000원, 전월실적조건 : 없음, 상세혜택 : 모든 가맹점 이용금액 1,000원당 1마일리지 기본적립, 백화점/주유/커피/편의점/택시 이용금액 1,000원당 2마일리지 특별적립, 인천공항 라운지 본인 무료 이용, 인천공항 발렛파킹 무료 이용, 공항 커피 서비스, 아멕스 PLATINUM 등급 서비스 ";
}

